# GenericNonFatalError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..GenericNonFatalError Property
BuiltInFailures..::..GeneralFailures Class See Also
---
A serious error has occurred. It is strongly recommended that you use Save As to save your work in a new file before continuing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GenericNonFatalError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GenericNonFatalError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GenericNonFatalError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace